src/com/tilab/wsig/examples/xml/MathFunctionsMapper-AbsComplex.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:MathFunctionsMapper">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:abs_Complex soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <complex xsi:type="urn:complex">
            <real xsi:type="xsd:float">4</real>
            <immaginary xsi:type="xsd:float">5</immaginary>
         </complex>
      </urn:abs_Complex>
   </soapenv:Body>
</soapenv:Envelope>